#include <reg52.h>
#include "key.h"
#include "delay.h"

/*
6个端口    L是列，H是行
 */
sbit L3 = P0^0;
sbit L2 = P0^1;
sbit L1 = P0^2;
sbit H1 = P0^3;
sbit H2 = P0^4;
sbit H3 = P0^5;   


/****************************************************************
* @name unsigned char Key_Scan()
* @brief 程序的作用是按键值扫描函数
* @param  command：void
* @return status ：扫键值
*****************************************************************/

unsigned int Key_Scan()
{
	H1 = 1;
	H2 = 1;
	H3 = 1;
	L1 = 0;
	L2 = 0;
	L3 = 0;
	
	if((L1 != 0) || (L2 != 0) || (L3 != 0) || (H1 != 1) || (H2 != 1) || (H3 != 1))      //说明有键按下
	{
		delay_ms(10);
		if((L1 != 0) || (L2 != 0) || (L3 != 0) || (H1 != 1) || (H2 != 1) || (H3 != 1))  //确实有键按下
		{
			/*扫描第一行*/
			L1 = 0;
			L2 = 1;
			L3 = 1;
			H1 = 1;
			H2 = 1;
			H3 = 1;
					
			if((L1 != 0) || (L2 != 1) || (L3 != 1)|| (H1 != 1) || (H2 != 1) || (H3 != 1))
			{
				H1 = H1;
	            H2 = H2;
	            H3 = H3;
	            L1 = 0;
	            L2 = 1;
	            L3 = 1;
				if((H1 == 0) && (H2 == 1) && (H3 == 1))           //led第一列
				{
					return 7;
                }
				else if((H1 == 1) && (H2 == 0) && (H3 == 1))
				{
					return 4;
                }
				else if((H1 == 1) && (H2 == 1) && (H3 == 0))
				{
					return 1;
                }
				
            }
			/*扫描第二行*/
			L1 = 1;
			L2 = 0;
			L3 = 1;
			H1 = 1;
			H2 = 1;
			H3 = 1;
			
			if((L1 != 1) || (L2 != 0) || (L3 != 1) || (H1 != 1) || (H2 != 1) || (H3 != 1))
			{
				H1 = H1;
	            H2 = H2;
	            H3 = H3;
	            L1 = 1;
	            L2 = 0;
	            L3 = 1;
				
				if((H1 == 0) && (H2 == 1) && (H3 == 1))      //led第二列
				{
					return 8;
        }
				else if((H1 == 1) && (H2 == 0) && (H3 == 1))
				{
					return 5;
                }
				else if((H1 == 1) && (H2 == 1) && (H3 == 0))
				{
					return 2;
                }
            }
			/*扫描第三行*/
			L1 = 1;
			L2 = 1;
			L3 = 0;
			H1 = 1;
			H2 = 1;
			H3 = 1;
			
			if((L1 != 1) || (L2 != 1) || (L3 != 0) || (H1 != 1) || (H2 != 1) || (H3 != 1))
			{
				H1 = H1;
	            H2 = H2;
	            H3 = H3;
	            L1 = 1;
	            L2 = 1;
	            L3 = 0;
				if((H1 == 0) && (H2 == 1) && (H3 == 1))   //led第三列
				{
					return 9;
                }
				else if((H1 == 1) && (H2 == 0) && (H3 == 1))
				{
					return 6;
                }
				else if((H1 == 1) && (H2 == 1) && (H3 == 0))
				{
					return 3;
                }

            }
        }
    }
	return 0;
	
}
